nxp-mcuxpresso/mcux-soc-svd/KW45Z41083/KW45Z41083.xml
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMCFG[%s]</name>
          <description>Timer Configuration N Register</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSTART</name>
              <description>Timer Start Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Start bit disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Start bit enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSTOP</name>
              <description>Timer Stop Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stop_disable</name>
                  <description>Stop bit disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable_tmrcmp</name>
                  <description>Stop bit is enabled on timer compare</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable_tmrdisable</name>
                  <description>Stop bit is enabled on timer disable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable_tmr_cmp_dis</name>
                  <description>Stop bit is enabled on timer compare and timer disable</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMENA</name>
              <description>Timer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Timer always enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_nminus1_en</name>
                  <description>Timer enabled on Timer N-1 enable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_trighi_en</name>
                  <description>Timer enabled on Trigger high</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_trig_pin_hi_en</name>
                  <description>Timer enabled on Trigger high and Pin high</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_pinrise_en</name>
                  <description>Timer enabled on Pin rising edge</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_pinrise_trighi_en</name>
                  <description>Timer enabled on Pin rising edge and Trigger high</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_trigrise_en</name>
                  <description>Timer enabled on Trigger rising edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_trigedge_en</name>
                  <description>Timer enabled on Trigger rising or falling edge</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMDIS</name>
              <description>Timer Disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>never</name>
                  <description>Timer never disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_nminus1</name>
                  <description>Timer disabled on Timer N-1 disable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_cmp</name>
                  <description>Timer disabled on Timer compare (upper 8-bits match and decrement)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_cmp_triglow</name>
                  <description>Timer disabled on Timer compare (upper 8-bits match and decrement) and Trigger Low</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin_edge</name>
                  <description>Timer disabled on Pin rising or falling edge</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin_edge_trighi</name>
                  <description>Timer disabled on Pin rising or falling edge provided Trigger is high</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_falledge</name>
                  <description>Timer disabled on Trigger falling edge</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMRST</name>
              <description>Timer Reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>never</name>
                  <description>Timer never reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_out_hi</name>
                  <description>Timer reset on Timer Output high.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin_eq_tmr_out</name>
                  <description>Timer reset on Timer Pin equal to Timer Output</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_eq_tmr_out</name>
                  <description>Timer reset on Timer Trigger equal to Timer Output</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin_rise_edge</name>
                  <description>Timer reset on Timer Pin rising edge</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_rise_edge</name>
                  <description>Timer reset on Trigger rising edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_edge</name>
                  <description>Timer reset on Trigger rising or falling edge</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMDEC</name>
              <description>Timer Decrement</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>flexio_clk_shiftclk_tmr_out</name>
                  <description>Decrement counter on FlexIO clock, Shift clock equals Timer output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_edge_shiftclk_tmr_out</name>
                  <description>Decrement counter on Trigger input (both edges), Shift clock equals Timer output.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin_edge_shiftclk_tmr_out</name>
                  <description>Decrement counter on Pin input (both edges), Shift clock equals Pin input.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_edge_shiftclk_trig_in</name>
                  <description>Decrement counter on Trigger input (both edges), Shift clock equals Trigger input.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flexio_clk_div16_shiftclk_tmr_out</name>
                  <description>Decrement counter on FlexIO clock divided by 16, Shift clock equals Timer output.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flexio_clk_div256_shiftclk_tmr_out</name>
                  <description>Decrement counter on FlexIO clock divided by 256, Shift clock equals Timer output.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin_rise_shiftclk_pin_in</name>
                  <description>Decrement counter on Pin input (rising edge), Shift clock equals Pin input.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_rise_shiftclk_trig_in</name>
                  <description>Decrement counter on Trigger input (rising edge), Shift clock equals Trigger input.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMOUT</name>
              <description>Timer Output</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>one</name>
                  <description>Timer output is logic one when enabled and is not affected by timer reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Timer output is logic zero when enabled and is not affected by timer reset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one_tmrreset</name>
                  <description>Timer output is logic one when enabled and on timer reset</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero_tmrreset</name>
                  <description>Timer output is logic zero when enabled and on timer reset</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMCMP[%s]</name>
          <description>Timer Compare N Register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP</name>
              <description>Timer Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFNBS[%s]</name>
          <description>Shifter Buffer N Nibble Byte Swapped Register</description>
          <addressOffset>0x680</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFHWS[%s]</name>
          <description>Shifter Buffer N Half Word Swapped Register</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFHWS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFNIS[%s]</name>
          <description>Shifter Buffer N Nibble Swapped Register</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNIS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFOES[%s]</name>
          <description>Shifter Buffer N Odd Even Swapped Register</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFOES</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFEOS[%s]</name>
          <description>Shifter Buffer N Even Odd Swapped Register</description>
          <addressOffset>0x880</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFEOS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFHBS[%s]</name>
          <description>Shifter Buffer N Halfword Byte Swapped Register</description>
          <addressOffset>0x900</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFHBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
