nxp-mcuxpresso/mcux-soc-svd/KW45Z41083/KW45Z41083.xml
        <register>
          <name>PL1_LO</name>
          <description>Pretended Networking Payload Low Filter 1 Register</description>
          <addressOffset>0xB14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Data_byte_3</name>
              <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to data byte 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_2</name>
              <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to data byte 2.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_1</name>
              <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to data byte 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_0</name>
              <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to data byte 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PL1_HI</name>
          <description>Pretended Networking Payload High Filter 1 Register</description>
          <addressOffset>0xB18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Data_byte_7</name>
              <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to data byte 7.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_6</name>
              <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to data byte 6.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_5</name>
              <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to data byte 5.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_4</name>
              <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to data byte 4.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLT_ID2_IDMASK</name>
          <description>Pretended Networking ID Filter 2 Register / ID Mask Register</description>
          <addressOffset>0xB1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLT_ID2_IDMASK</name>
              <description>ID Filter 2 for Pretended Networking Filtering / ID Mask Bits for Pretended Networking ID Filtering</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTR_MSK</name>
              <description>Remote Transmission Request Mask Bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>frame_type_no</name>
                  <description>The corresponding bit in the filter is &quot;don't care&quot;</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>frame_type_yes</name>
                  <description>The corresponding bit in the filter is checked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDE_MSK</name>
              <description>ID Extended Mask Bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>frame_format_no</name>
                  <description>The corresponding bit in the filter is &quot;don't care&quot;</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>frame_format_yes</name>
                  <description>The corresponding bit in the filter is checked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PL2_PLMASK_LO</name>
          <description>Pretended Networking Payload Low Filter 2 Register / Payload Low Mask register</description>
          <addressOffset>0xB20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Data_byte_3</name>
              <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_2</name>
              <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 2.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_1</name>
              <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_0</name>
              <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PL2_PLMASK_HI</name>
          <description>Pretended Networking Payload High Filter 2 low order bits / Payload High Mask register</description>
          <addressOffset>0xB24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Data_byte_7</name>
              <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 7.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_6</name>
              <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 6.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_5</name>
              <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 5.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Data_byte_4</name>
              <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 4.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>WMB[%s]</name>
          <description>Array of registers: WMB_CS, WMB_D03, WMB_D47, WMB_ID</description>
          <addressOffset>0xB40</addressOffset>
          <register>
            <name>WMB_CS</name>
            <description>Wake Up Message Buffer register for C/S</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DLC</name>
                <description>Length of Data in Bytes</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RTR</name>
                <description>Remote Transmission Request Bit</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>not_remote</name>
                    <description>Frame is data one (not remote)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>remote</name>
                    <description>Frame is a remote one</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IDE</name>
                <description>ID Extended Bit</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>standard</name>
                    <description>Frame format is standard</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>extended</name>
                    <description>Frame format is extended</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRR</name>
                <description>Substitute Remote Request</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WMB_ID</name>
            <description>Wake Up Message Buffer Register for ID</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ID</name>
                <description>Received ID under Pretended Networking mode</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WMB_D03</name>
            <description>Wake Up Message Buffer Register for Data 0-3</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Data_byte_3</name>
                <description>Received payload corresponding to the data byte 3 under Pretended Networking mode</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>Data_byte_2</name>
                <description>Received payload corresponding to the data byte 2 under Pretended Networking mode</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>Data_byte_1</name>
                <description>Received payload corresponding to the data byte 1 under Pretended Networking mode</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>Data_byte_0</name>
                <description>Received payload corresponding to the data byte 0 under Pretended Networking mode</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WMB_D47</name>
            <description>Wake Up Message Buffer Register Data 4-7</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Data_byte_7</name>
                <description>Received payload corresponding to the data byte 7 under Pretended Networking mode</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>Data_byte_6</name>
                <description>Received payload corresponding to the data byte 6 under Pretended Networking mode</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>Data_byte_5</name>
                <description>Received payload corresponding to the data byte 5 under Pretended Networking mode</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>Data_byte_4</name>
                <description>Received payload corresponding to the data byte 4 under Pretended Networking mode</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>EPRS</name>
          <description>Enhanced CAN Bit Timing Prescalers</description>
          <addressOffset>0xBF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENPRESDIV</name>
              <description>Extended Nominal Prescaler Division Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDPRESDIV</name>
              <description>Extended Data Phase Prescaler Division Factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENCBT</name>
          <description>Enhanced Nominal CAN Bit Timing</description>
          <addressOffset>0xBF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NTSEG1</name>
              <description>Nominal Time Segment 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NTSEG2</name>
              <description>Nominal Time Segment 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRJW</name>
              <description>Nominal Resynchronization Jump Width</description>
              <bitOffset>22</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDCBT</name>
          <description>Enhanced Data Phase CAN bit Timing</description>
          <addressOffset>0xBF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTSEG1</name>
              <description>Data Phase Segment 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTSEG2</name>
              <description>Data Phase Time Segment 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DRJW</name>
              <description>Data Phase Resynchronization Jump Width</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETDC</name>
          <description>Enhanced Transceiver Delay Compensation</description>
          <addressOffset>0xBFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ETDCVAL</name>
              <description>Enhanced Transceiver Delay Compensation Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ETDCFAIL</name>
              <description>Transceiver Delay Compensation Fail</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>in_range</name>
                  <description>Measured loop delay is in range.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>out_of_range</name>
                  <description>Measured loop delay is out of range.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETDCOFF</name>
              <description>Enhanced Transceiver Delay Compensation Offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDMDIS</name>
              <description>Transceiver Delay Measurement Disable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>TDC measurement is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>TDC measurement is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETDCEN</name>
              <description>Transceiver Delay Compensation Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>TDC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>TDC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
